//
//  UIColorExtention.swift
//  BwtcCoffeeShop
//
//  Created by mac on 21.04.2023.
//

import UIKit
extension UIColor {
    static var tabBarItemAccent: UIColor {
        #colorLiteral(red: 0.6000000238, green: 0.6000000238, blue: 0.6000000238, alpha: 1)
    }
    static var mainOragge: UIColor {
        #colorLiteral(red: 0.9444422126, green: 0.5452092886, blue: 0.4019585252, alpha: 1)
    }
    static var tabBarItemLight: UIColor {
        #colorLiteral(red: 0.8039215803, green: 0.8039215803, blue: 0.8039215803, alpha: 1)
    }
}


var text = " Ethiopia Guji Shonora Країна: Ethiopia Регіон: Oromia Різновид: Heirloom Метод обробки: Natural Висота: 1900 - 2300 м.н.р.м Про Shonora coffee Це зерно походить із зони Guji південного регіону Oromia, що вважаться батьківщиною кави. Він має ідеальні умови для вирощування арабіки: значну висотність (понад 1500 м.); багаті, добре дреновані (в основному вулканічні) ґрунти, що майже не потребують додаткових добрив; високогірний тропічний клімат із 1500–2500 мм опадів протягом дев’ятимісячного періоду та оптимальними температурами від 15 до 24°C. За останні 60 років швидкий комерційний та культурний розвиток перетворив Guji на унікальну кавову зону, яка з 2002 стала окремою адміністративною одиницею. Кава звідси представляє характерний терруар, який відрізняє її від іншого зерна регіону Oromia 25 років тому родина Shonora стали першими кавовими продюсерами в Guji. На початку 1990-х років Shonora Gata став одним з перших, хто побудував станцію сухої обробки кави в місті Gerba та станцію митої обробки в Sakicha на Заході регіону. Як найбільший виробник і експортер якісної кави в Ефіопії, Shonora Coffee Trading пишається історією постачання якісної кави на місцевий і міжнародний ринки. Вони працюють безпосередньо з дрібними фермерами з Guji, Suke Kutu та Urga в регіоні Oromia та збирають каву для переробки та експорту. Зараз станція переробляє каву із 150 місцевих ферм, розташованих на висоті 1900-2300 м.н.р.м."



